#include <lib.h>

void main(void)
{
	int r0 = 22;
	int r1 = 23;
	int r2 = 24;
	int w0, w1, w2;

	__asm__ __volatile__(
		"nop\n"
		"mov r0, %[r0]\n" 
		"mov %[w0], r0\n"

		"mov r1, %[r1]\n" 
		"mov %[w1], r1\n"

		"mov r2, %[r2]\n" 
		"mov %[w2], r2\n"
		"nop"

		:[w0]"=&r"(w0),[w1]"=&r"(w1),[w2]"=&r"(w2) //其中&号告诉编译器给本C语言变量分配的寄存器不能再分配给其余变量
		:[r0]"r"(r0),[r1]"r"(r1),[r2]"r"(r2)
		//显示指定占位符，以上通过方括号表示的就是可用的占位符的另一种方式。隐式占位符同样可以用。
		:"r0","r1","r2"
	);
	__asm__ __volatile__(
		"nop\n"
		"mov r0, %[r0]\n" 
		"mov %[w0], r0\n"

		"mov r1, %[r1]\n" 
		"mov %[w1], r1\n"

		"mov r2, %[r2]\n" 
		"mov %[w2], r2\n"
		"nop"

		:[w0]"=&r"(w0),[w1]"=&r"(w1),[w2]"=&r"(w2) //其中&号告诉编译器给本C语言变量分配的寄存器不能再分配给其余变量
		:[r0]"r"(r0),[r1]"r"(r1),[r2]"r"(r2)
		//显示指定占位符，以上通过方括号表示的就是可用的占位符的另一种方式。隐式占位符同样可以用。
		:"r0","r1","r2"
	);
	__asm__ __volatile__(
		"nop\n"
		"mov r0, %[r0]\n" 
		"mov %[w0], r0\n"

		"mov r1, %[r1]\n" 
		"mov %[w1], r1\n"

		"mov r2, %[r2]\n" 
		"mov %[w2], r2\n"
		"nop"

		:[w0]"=&r"(w0),[w1]"=&r"(w1),[w2]"=&r"(w2) //其中&号告诉编译器给本C语言变量分配的寄存器不能再分配给其余变量
		:[r0]"r"(r0),[r1]"r"(r1),[r2]"r"(r2)
		//显示指定占位符，以上通过方括号表示的就是可用的占位符的另一种方式。隐式占位符同样可以用。
		:"r0","r1","r2"
	);

	printf("w0 = %d\n", w0);
	printf("w1 = %d\n", w1);
	printf("w2 = %d\n", w2);
}
